# 1. Напишите функцию с именем times ten. Эта функция должна принимать
# аргумент и показывать результат произведения аргумента на 1 О

def timesTen(x):
    y = x * 10
    print(y)
