# Напишите инструкцию Python, которая присваивает сумму 10 и 14 переменной total.
# total
total = 10 + 14
# print(total)
