# Дни в феврале. Февраль обычно имеет 28 дней. Но в високосный год в феврале 29 дней. Напишите программу,
# которая просит пользователя ввести год. Затем она должна показать количество дней в феврале в этом году. Для
# определения високосных лет используйте следующие критерии. Определить, делится ли год на 100. Если да, то этот год
# високосный тогда и только тогда, если он также делится на 400. Например, 2000 является високосным годом,
# а 2100 нет. Если год не делится на 100, то этот год високосный тогда и только тогда, если он делится на 4.
# Например, 2008 является високосным годом, но 2009 нет. Глава 3. Структуры принятия решения и булева логика 173 Вот
# пример выполнения этой программы: Введите год: 2008 IEnterl В 2008 году в феврале 29 дней.

# February Days

year = abs(int(input("Enter a year: ")))
if year % 100 == 0:
    if year % 400 == 0:
        days = 29
    else:
        days = 28
else:
    if year % 4 == 0:
        days = 29
    else:
        days = 28
print("In", year, "February has", days, "days")


# alternative answer
year = abs(int(input("Enter a year: ")))
if (year % 4 == 0 and year % 100 != 0) or (year % 100 == 0 and year % 400 == 0):
    days = 29
else:
    days = 28
print("In", year, "February has", days, "days")